name: "SegNet"
layer {
	name: "data"
	type: "HDF5Data"
	top: "data"
	top: "labels"
	include {
		phase: TRAIN
	}
	hdf5_data_param {
		source : "/home/grochette/Documents/SegNet/data/CleanData/HDF5/Train/hdf5_list.txt"
		batch_size: 2
		shuffle: true
	}
}
layer {
	name: "data"
	type: "HDF5Data"
	top: "data"
	top: "labels"
	include {
		phase: TEST
	}
	hdf5_data_param {
		source : "/home/grochette/Documents/SegNet/data/CleanData/HDF5/Validation/hdf5_list.txt"
		batch_size: 2
	}
}
layer {
	name: "batchnorm0"
	type: "BatchNorm"
	bottom: "data"
	top: "data"
}
layer {
	name: "conv1_1"
	type: "Convolution"
	bottom: "data"
	top: "conv1_1"
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}
layer {
	name: "batchnorm1_1"
	type: "BatchNorm"
	bottom: "conv1_1"
	top: "conv1_1"
}
layer {
	name: "elu1_1"
	type: "ELU"
	bottom: "conv1_1"
	top: "conv1_1"
}
layer {
	name: "conv1_2"
	type: "Convolution"
	bottom: "conv1_1"
	top: "conv1_2"
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}
layer {
	name: "batchnorm1_2"
	type: "BatchNorm"
	bottom: "conv1_2"
	top: "conv1_2"
}
layer {
	name: "elu1_2"
	type: "ELU"
	bottom: "conv1_2"
	top: "conv1_2"
}
layer {
	name: "conv1_3"
	type: "Convolution"
	bottom: "conv1_2"
	top: "conv1_3"
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 2
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}
layer {
	name: "conv2_1"
	type: "Convolution"
	bottom: "conv1_3"
	top: "conv2_1"
	convolution_param {
		num_output: 128
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}
layer {
	name: "batchnorm2_1"
	type: "BatchNorm"
	bottom: "conv2_1"
	top: "conv2_1"
}
layer {
	name: "elu2_1"
	type: "ELU"
	bottom: "conv2_1"
	top: "conv2_1"
}
layer {
	name: "conv2_2"
	type: "Convolution"
	bottom: "conv2_1"
	top: "conv2_2"
	convolution_param {
		num_output: 128
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}
layer {
	name: "batchnorm2_2"
	type: "BatchNorm"
	bottom: "conv2_2"
	top: "conv2_2"
}
layer {
	name: "elu2_2"
	type: "ELU"
	bottom: "conv2_2"
	top: "conv2_2"
}
layer {
	name: "conv2_3"
	type: "Convolution"
	bottom: "conv2_2"
	top: "conv2_3"
	convolution_param {
		num_output: 128
		pad: 0
		kernel_size: 2
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}
layer {
	name: "conv3_1"
	type: "Convolution"
	bottom: "conv2_3"
	top: "conv3_1"
	convolution_param {
		num_output: 256
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}
layer {
	name: "batchnorm3_1"
	type: "BatchNorm"
	bottom: "conv3_1"
	top: "conv3_1"
}
layer {
	name: "elu3_1"
	type: "ELU"
	bottom: "conv3_1"
	top: "conv3_1"
}
layer {
	name: "conv3_2"
	type: "Convolution"
	bottom: "conv3_1"
	top: "conv3_2"
	convolution_param {
		num_output: 256
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}
layer {
	name: "batchnorm3_2"
	type: "BatchNorm"
	bottom: "conv3_2"
	top: "conv3_2"
}
layer {
	name: "elu3_2"
	type: "ELU"
	bottom: "conv3_2"
	top: "conv3_2"
}
layer {
	name: "deconv3"
	type: "Deconvolution"
	bottom: "conv3_2"
	top: "deconv3"
	convolution_param {
		num_output: 256
		pad: 0
		kernel_size: 2
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}
layer {
	name: "deconv2_1"
	type: "Deconvolution"
	bottom: "deconv3"
	top: "deconv2_1"
	convolution_param {
		num_output: 128
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}
layer {
	name: "debatchnorm2_1"
	type: "BatchNorm"
	bottom: "deconv2_1"
	top: "deconv2_1"
}
layer {
	name: "deelu2_1"
	type: "ELU"
	bottom: "deconv2_1"
	top: "deconv2_1"
}
layer {
	name: "deconv2_2"
	type: "Deconvolution"
	bottom: "deconv2_1"
	top: "deconv2_2"
	convolution_param {
		num_output: 128
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}
layer {
	name: "debatchnorm2_2"
	type: "BatchNorm"
	bottom: "deconv2_2"
	top: "deconv2_2"
}
layer {
	name: "deelu2_2"
	type: "ELU"
	bottom: "deconv2_2"
	top: "deconv2_2"
}
layer {
	name: "deconv2_3"
	type: "Deconvolution"
	bottom: "deconv2_2"
	top: "deconv2_3"
	convolution_param {
		num_output: 128
		pad: 0
		kernel_size: 2
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}
layer {
	name: "deconv1_1"
	type: "Deconvolution"
	bottom: "deconv2_3"
	top: "deconv1_1"
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}
layer {
	name: "debatchnorm1_1"
	type: "BatchNorm"
	bottom: "deconv1_1"
	top: "deconv1_1"
}
layer {
	name: "deelu1_1"
	type: "ELU"
	bottom: "deconv1_1"
	top: "deconv1_1"
}
layer {
	name: "deconv1_2"
	type: "Deconvolution"
	bottom: "deconv1_1"
	top: "deconv1_2"
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}
layer {
	name: "debatchnorm1_2"
	type: "BatchNorm"
	bottom: "deconv1_2"
	top: "deconv1_2"
}
layer {
	name: "deelu1_2"
	type: "ELU"
	bottom: "deconv1_2"
	top: "deconv1_2"
}
layer {
	name: "segmentation"
	type: "Convolution"
	bottom: "deconv1_2"
	top: "segmentation"
	convolution_param {
		num_output: 2
		pad: 0
		kernel_size: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "segmentation"
  bottom: "labels"
  top: "loss"
  loss_param {
    ignore_label: 2
    normalize: false
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "segmentation"
  bottom: "labels"
  top: "accuracy"
  include {
    phase: TEST
  }
  accuracy_param {
    ignore_label: 2
  }
}
