name: "DeconvNet"
#layer {
#	name: "data"
#	type: "Data"
#	top: "data"
#	include {
#	    phase: TRAIN
#	}
#	data_param {
#	    batch_size: 8
#	    backend: LMDB
#	}
#}

#layer {
#	name: "labels"
#	type: "Data"
#	top: "labels"
#	include {
#	    phase: TRAIN
#	}
#	data_param {
#	    batch_size: 8
#	    backend: LMDB
#	}
#}

#layer {
#	name: "data"
#	type: "Data"
#	top: "data"
#	include {
#	    phase: TEST
#	}
#	data_param {
#	    batch_size: 1
#	    backend: LMDB
#	}
#}

#layer {
#	name: "labels"
#	type: "Data"
#	top: "labels"
#	include {
#	    phase: TEST
#	}
#	data_param {
#	    batch_size: 1
#	    backend: LMDB
#	}
#}

layer {
    name: "data"
    type: "Input"
    top: "data"
    input_param {
        shape {
            dim: 1
            dim: 3
            dim: 224
            dim: 224
        }
    }
}

layer {
	name: "labels"
	type: "Input"
	top: "labels"
	input_param {
		shape {
			dim: 1
			dim: 1
			dim: 224
			dim: 224
		}
	}
}

layer {
    name: "mean_shift"
    type: "Power"
    bottom: "data"
    top: "data"
    power_param {
        shift: -116.0
    }
}

layer {
	name: "conv1_1"
	type: "Convolution"
	bottom: "data"
	top: "conv1_1"
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm1_1"
	type: "BatchNorm"
	bottom: "conv1_1"
	top: "conv1_1"
}

layer {
	name: "relu1_1"
	type: "ReLU"
	bottom: "conv1_1"
	top: "conv1_1"
}

layer {
	name: "conv1_2"
	type: "Convolution"
	bottom: "conv1_1"
	top: "conv1_2"
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm1_2"
	type: "BatchNorm"
	bottom: "conv1_2"
	top: "conv1_2"
}

layer {
	name: "relu1_2"
	type: "ReLU"
	bottom: "conv1_2"
	top: "conv1_2"
}

layer {
	name: "conv1_3"
	type: "Convolution"
	bottom: "conv1_2"
	top: "conv1_3"
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 4
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm1_3"
	type: "BatchNorm"
	bottom: "conv1_3"
	top: "conv1_3"
}

layer {
	name: "relu1_3"
	type: "ReLU"
	bottom: "conv1_3"
	top: "conv1_3"
}

layer {
	name: "conv2_1"
	type: "Convolution"
	bottom: "conv1_3"
	top: "conv2_1"
	convolution_param {
		num_output: 128
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm2_1"
	type: "BatchNorm"
	bottom: "conv2_1"
	top: "conv2_1"
}

layer {
	name: "relu2_1"
	type: "ReLU"
	bottom: "conv2_1"
	top: "conv2_1"
}

layer {
	name: "conv2_2"
	type: "Convolution"
	bottom: "conv2_1"
	top: "conv2_2"
	convolution_param {
		num_output: 128
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm2_2"
	type: "BatchNorm"
	bottom: "conv2_2"
	top: "conv2_2"
}

layer {
	name: "relu2_2"
	type: "ReLU"
	bottom: "conv2_2"
	top: "conv2_2"
}

layer {
	name: "conv2_3"
	type: "Convolution"
	bottom: "conv2_2"
	top: "conv2_3"
	convolution_param {
		num_output: 128
		pad: 1
		kernel_size: 4
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm2_3"
	type: "BatchNorm"
	bottom: "conv2_3"
	top: "conv2_3"
}

layer {
	name: "relu2_3"
	type: "ReLU"
	bottom: "conv2_3"
	top: "conv2_3"
}

layer {
	name: "conv3_1"
	type: "Convolution"
	bottom: "conv2_3"
	top: "conv3_1"
	convolution_param {
		num_output: 256
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm3_1"
	type: "BatchNorm"
	bottom: "conv3_1"
	top: "conv3_1"
}

layer {
	name: "relu3_1"
	type: "ReLU"
	bottom: "conv3_1"
	top: "conv3_1"
}

layer {
	name: "conv3_2"
	type: "Convolution"
	bottom: "conv3_1"
	top: "conv3_2"
	convolution_param {
		num_output: 256
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm3_2"
	type: "BatchNorm"
	bottom: "conv3_2"
	top: "conv3_2"
}

layer {
	name: "relu3_2"
	type: "ReLU"
	bottom: "conv3_2"
	top: "conv3_2"
}

layer {
	name: "conv3_3"
	type: "Convolution"
	bottom: "conv3_2"
	top: "conv3_3"
	convolution_param {
		num_output: 256
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm3_3"
	type: "BatchNorm"
	bottom: "conv3_3"
	top: "conv3_3"
}

layer {
	name: "relu3_3"
	type: "ReLU"
	bottom: "conv3_3"
	top: "conv3_3"
}

layer {
	name: "conv3_4"
	type: "Convolution"
	bottom: "conv3_3"
	top: "conv3_4"
	convolution_param {
		num_output: 256
		pad: 1
		kernel_size: 4
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm3_4"
	type: "BatchNorm"
	bottom: "conv3_4"
	top: "conv3_4"
}

layer {
	name: "relu3_4"
	type: "ReLU"
	bottom: "conv3_4"
	top: "conv3_4"
}

layer {
	name: "conv4_1"
	type: "Convolution"
	bottom: "conv3_4"
	top: "conv4_1"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm4_1"
	type: "BatchNorm"
	bottom: "conv4_1"
	top: "conv4_1"
}

layer {
	name: "relu4_1"
	type: "ReLU"
	bottom: "conv4_1"
	top: "conv4_1"
}

layer {
	name: "conv4_2"
	type: "Convolution"
	bottom: "conv4_1"
	top: "conv4_2"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm4_2"
	type: "BatchNorm"
	bottom: "conv4_2"
	top: "conv4_2"
}

layer {
	name: "relu4_2"
	type: "ReLU"
	bottom: "conv4_2"
	top: "conv4_2"
}

layer {
	name: "conv4_3"
	type: "Convolution"
	bottom: "conv4_2"
	top: "conv4_3"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm4_3"
	type: "BatchNorm"
	bottom: "conv4_3"
	top: "conv4_3"
}

layer {
	name: "relu4_3"
	type: "ReLU"
	bottom: "conv4_3"
	top: "conv4_3"
}

layer {
	name: "conv4_4"
	type: "Convolution"
	bottom: "conv4_3"
	top: "conv4_4"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 4
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm4_4"
	type: "BatchNorm"
	bottom: "conv4_4"
	top: "conv4_4"
}

layer {
	name: "relu4_4"
	type: "ReLU"
	bottom: "conv4_4"
	top: "conv4_4"
}

layer {
	name: "conv5_1"
	type: "Convolution"
	bottom: "conv4_4"
	top: "conv5_1"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm5_1"
	type: "BatchNorm"
	bottom: "conv5_1"
	top: "conv5_1"
}

layer {
	name: "relu5_1"
	type: "ReLU"
	bottom: "conv5_1"
	top: "conv5_1"
}

layer {
	name: "conv5_2"
	type: "Convolution"
	bottom: "conv5_1"
	top: "conv5_2"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm5_2"
	type: "BatchNorm"
	bottom: "conv5_2"
	top: "conv5_2"
}

layer {
	name: "relu5_2"
	type: "ReLU"
	bottom: "conv5_2"
	top: "conv5_2"
}

layer {
	name: "conv5_3"
	type: "Convolution"
	bottom: "conv5_2"
	top: "conv5_3"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm5_3"
	type: "BatchNorm"
	bottom: "conv5_3"
	top: "conv5_3"
}

layer {
	name: "relu5_3"
	type: "ReLU"
	bottom: "conv5_3"
	top: "conv5_3"
}

layer {
	name: "conv5_4"
	type: "Convolution"
	bottom: "conv5_3"
	top: "conv5_4"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 4
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "batchnorm5_4"
	type: "BatchNorm"
	bottom: "conv5_4"
	top: "conv5_4"
}

layer {
	name: "relu5_4"
	type: "ReLU"
	bottom: "conv5_4"
	top: "conv5_4"
}

layer {
	name: "deconv5_1"
	type: "Deconvolution"
	bottom: "conv5_4"
	top: "deconv5_1"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 4
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm5_1"
	type: "BatchNorm"
	bottom: "deconv5_1"
	top: "deconv5_1"
}

layer {
	name: "derelu5_1"
	type: "ReLU"
	bottom: "deconv5_1"
	top: "deconv5_1"
}

layer {
	name: "deconv5_2"
	type: "Deconvolution"
	bottom: "deconv5_1"
	top: "deconv5_2"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm5_2"
	type: "BatchNorm"
	bottom: "deconv5_2"
	top: "deconv5_2"
}

layer {
	name: "derelu5_2"
	type: "ReLU"
	bottom: "deconv5_2"
	top: "deconv5_2"
}

layer {
	name: "deconv5_3"
	type: "Deconvolution"
	bottom: "deconv5_2"
	top: "deconv5_3"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm5_3"
	type: "BatchNorm"
	bottom: "deconv5_3"
	top: "deconv5_3"
}

layer {
	name: "derelu5_3"
	type: "ReLU"
	bottom: "deconv5_3"
	top: "deconv5_3"
}

layer {
	name: "deconv5_4"
	type: "Deconvolution"
	bottom: "deconv5_3"
	top: "deconv5_4"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm5_4"
	type: "BatchNorm"
	bottom: "deconv5_4"
	top: "deconv5_4"
}

layer {
	name: "derelu5_4"
	type: "ReLU"
	bottom: "deconv5_4"
	top: "deconv5_4"
}

layer {
	name: "deconv4_1"
	type: "Deconvolution"
	bottom: "deconv5_4"
	top: "deconv4_1"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 4
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm4_1"
	type: "BatchNorm"
	bottom: "deconv4_1"
	top: "deconv4_1"
}

layer {
	name: "derelu4_1"
	type: "ReLU"
	bottom: "deconv4_1"
	top: "deconv4_1"
}

layer {
	name: "deconv4_2"
	type: "Deconvolution"
	bottom: "deconv4_1"
	top: "deconv4_2"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm4_2"
	type: "BatchNorm"
	bottom: "deconv4_2"
	top: "deconv4_2"
}

layer {
	name: "derelu4_2"
	type: "ReLU"
	bottom: "deconv4_2"
	top: "deconv4_2"
}

layer {
	name: "deconv4_3"
	type: "Deconvolution"
	bottom: "deconv4_2"
	top: "deconv4_3"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm4_3"
	type: "BatchNorm"
	bottom: "deconv4_3"
	top: "deconv4_3"
}

layer {
	name: "derelu4_3"
	type: "ReLU"
	bottom: "deconv4_3"
	top: "deconv4_3"
}

layer {
	name: "deconv4_4"
	type: "Deconvolution"
	bottom: "deconv4_3"
	top: "deconv4_4"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm4_4"
	type: "BatchNorm"
	bottom: "deconv4_4"
	top: "deconv4_4"
}

layer {
	name: "derelu4_4"
	type: "ReLU"
	bottom: "deconv4_4"
	top: "deconv4_4"
}

layer {
	name: "deconv3_1"
	type: "Deconvolution"
	bottom: "deconv4_4"
	top: "deconv3_1"
	convolution_param {
		num_output: 256
		pad: 1
		kernel_size: 4
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm3_1"
	type: "BatchNorm"
	bottom: "deconv3_1"
	top: "deconv3_1"
}

layer {
	name: "derelu3_1"
	type: "ReLU"
	bottom: "deconv3_1"
	top: "deconv3_1"
}

layer {
	name: "deconv3_2"
	type: "Deconvolution"
	bottom: "deconv3_1"
	top: "deconv3_2"
	convolution_param {
		num_output: 256
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm3_2"
	type: "BatchNorm"
	bottom: "deconv3_2"
	top: "deconv3_2"
}

layer {
	name: "derelu3_2"
	type: "ReLU"
	bottom: "deconv3_2"
	top: "deconv3_2"
}

layer {
	name: "deconv3_3"
	type: "Deconvolution"
	bottom: "deconv3_2"
	top: "deconv3_3"
	convolution_param {
		num_output: 256
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm3_3"
	type: "BatchNorm"
	bottom: "deconv3_3"
	top: "deconv3_3"
}

layer {
	name: "derelu3_3"
	type: "ReLU"
	bottom: "deconv3_3"
	top: "deconv3_3"
}

layer {
	name: "deconv3_4"
	type: "Deconvolution"
	bottom: "deconv3_3"
	top: "deconv3_4"
	convolution_param {
		num_output: 256
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm3_4"
	type: "BatchNorm"
	bottom: "deconv3_4"
	top: "deconv3_4"
}

layer {
	name: "derelu3_4"
	type: "ReLU"
	bottom: "deconv3_4"
	top: "deconv3_4"
}

layer {
	name: "deconv2_1"
	type: "Deconvolution"
	bottom: "deconv3_4"
	top: "deconv2_1"
	convolution_param {
		num_output: 128
		pad: 1
		kernel_size: 4
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm2_1"
	type: "BatchNorm"
	bottom: "deconv2_1"
	top: "deconv2_1"
}

layer {
	name: "derelu2_1"
	type: "ReLU"
	bottom: "deconv2_1"
	top: "deconv2_1"
}

layer {
	name: "deconv2_2"
	type: "Deconvolution"
	bottom: "deconv2_1"
	top: "deconv2_2"
	convolution_param {
		num_output: 128
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm2_2"
	type: "BatchNorm"
	bottom: "deconv2_2"
	top: "deconv2_2"
}

layer {
	name: "derelu2_2"
	type: "ReLU"
	bottom: "deconv2_2"
	top: "deconv2_2"
}

layer {
	name: "deconv2_3"
	type: "Deconvolution"
	bottom: "deconv2_2"
	top: "deconv2_3"
	convolution_param {
		num_output: 128
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm2_3"
	type: "BatchNorm"
	bottom: "deconv2_3"
	top: "deconv2_3"
}

layer {
	name: "derelu2_3"
	type: "ReLU"
	bottom: "deconv2_3"
	top: "deconv2_3"
}

layer {
	name: "deconv1_1"
	type: "Deconvolution"
	bottom: "deconv2_3"
	top: "deconv1_1"
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 4
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm1_1"
	type: "BatchNorm"
	bottom: "deconv1_1"
	top: "deconv1_1"
}

layer {
	name: "derelu1_1"
	type: "ReLU"
	bottom: "deconv1_1"
	top: "deconv1_1"
}

layer {
	name: "deconv1_2"
	type: "Deconvolution"
	bottom: "deconv1_1"
	top: "deconv1_2"
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm1_2"
	type: "BatchNorm"
	bottom: "deconv1_2"
	top: "deconv1_2"
}

layer {
	name: "derelu1_2"
	type: "ReLU"
	bottom: "deconv1_2"
	top: "deconv1_2"
}

layer {
	name: "deconv1_3"
	type: "Deconvolution"
	bottom: "deconv1_2"
	top: "deconv1_3"
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm1_3"
	type: "BatchNorm"
	bottom: "deconv1_3"
	top: "deconv1_3"
}

layer {
	name: "derelu1_3"
	type: "ReLU"
	bottom: "deconv1_3"
	top: "deconv1_3"
}

layer {
	name: "heatmap"
	type: "Convolution"
	bottom: "deconv1_3"
	top: "heatmap"
	convolution_param {
		num_output: 1
		pad: 0
		kernel_size: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "softmax_data"
	type: "Softmax"
	bottom: "heatmap"
	top: "softmax_data"
}

layer {
	name: "softmax_labels"
	type: "Softmax"
	bottom: "labels"
	top: "softmax_labels"
}

layer {
	name: "loss"
	type: "InfogainLoss"
	bottom: "softmax_data"
	bottom: "softmax_labels"
	top: "loss"
}
