name: "SegNet"
layer {
	name: "data"
	type: "HDF5Data"
	top: "data"
	top: "labels"
	include {
		phase: TRAIN
	}
	hdf5_data_param {
		source : "/home/guillaume/Documents/SegNet/data/Oakland_224x224/h5/TrainingSet/TrainingSet_h5_list.txt"
		batch_size: 4
		shuffle: true
	}
}

layer {
	name: "data"
	type: "HDF5Data"
	top: "data"
	top: "labels"
	include {
		phase: TEST
	}
	hdf5_data_param {
		source : "/home/guillaume/Documents/SegNet/data/Oakland_224x224/h5/ValidationSet/ValidationSet_h5_list.txt"
		batch_size: 4
	}
}

layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "data"
  top: "conv1_1"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
  name: "relu1_1"
  type: "ReLU"
  bottom: "conv1_1"
  top: "conv1_1"
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv1_2"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2"
  top: "conv1_2"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_1"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
  name: "relu2_1"
  type: "ReLU"
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "conv2_1"
  top: "conv2_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_1"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
  name: "relu3_1"
  type: "ReLU"
  bottom: "conv3_1"
  top: "conv3_1"
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_2"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "conv3_2"
  top: "conv3_3"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3_3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_1"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
  name: "relu4_1"
  type: "ReLU"
  bottom: "conv4_1"
  top: "conv4_1"
}
layer {
  name: "conv4_2"
  type: "Convolution"
  bottom: "conv4_1"
  top: "conv4_2"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
  name: "relu4_2"
  type: "ReLU"
  bottom: "conv4_2"
  top: "conv4_2"
}
layer {
  name: "conv4_3"
  type: "Convolution"
  bottom: "conv4_2"
  top: "conv4_3"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
  name: "relu4_3"
  type: "ReLU"
  bottom: "conv4_3"
  top: "conv4_3"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4_3"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5_1"
  type: "Convolution"
  bottom: "pool4"
  top: "conv5_1"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
  name: "relu5_1"
  type: "ReLU"
  bottom: "conv5_1"
  top: "conv5_1"
}
layer {
  name: "conv5_2"
  type: "Convolution"
  bottom: "conv5_1"
  top: "conv5_2"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
  name: "relu5_2"
  type: "ReLU"
  bottom: "conv5_2"
  top: "conv5_2"
}
layer {
  name: "conv5_3"
  type: "Convolution"
  bottom: "conv5_2"
  top: "conv5_3"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
  name: "relu5_3"
  type: "ReLU"
  bottom: "conv5_3"
  top: "conv5_3"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5_3"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
	name: "deconv5_1"
	type: "Deconvolution"
	bottom: "pool5"
	top: "deconv5_1"
	convolution_param {
		num_output: 512
		pad: 0
		kernel_size: 2
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "deconv5_2"
	type: "Deconvolution"
	bottom: "deconv5_1"
	top: "deconv5_2"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm5_2"
	type: "BatchNorm"
	bottom: "deconv5_2"
	top: "deconv5_2"
}

layer {
	name: "derelu5_2"
	type: "ReLU"
	bottom: "deconv5_2"
	top: "deconv5_2"
}

layer {
	name: "deconv5_3"
	type: "Deconvolution"
	bottom: "deconv5_2"
	top: "deconv5_3"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm5_3"
	type: "BatchNorm"
	bottom: "deconv5_3"
	top: "deconv5_3"
}

layer {
	name: "derelu5_3"
	type: "ReLU"
	bottom: "deconv5_3"
	top: "deconv5_3"
}

layer {
	name: "deconv5_4"
	type: "Deconvolution"
	bottom: "deconv5_3"
	top: "deconv5_4"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm5_4"
	type: "BatchNorm"
	bottom: "deconv5_4"
	top: "deconv5_4"
}

layer {
	name: "derelu5_4"
	type: "ReLU"
	bottom: "deconv5_4"
	top: "deconv5_4"
}

layer {
	name: "deconv4_1"
	type: "Deconvolution"
	bottom: "deconv5_4"
	top: "deconv4_1"
	convolution_param {
		num_output: 512
		pad: 0
		kernel_size: 2
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "deconv4_2"
	type: "Deconvolution"
	bottom: "deconv4_1"
	top: "deconv4_2"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm4_2"
	type: "BatchNorm"
	bottom: "deconv4_2"
	top: "deconv4_2"
}

layer {
	name: "derelu4_2"
	type: "ReLU"
	bottom: "deconv4_2"
	top: "deconv4_2"
}

layer {
	name: "deconv4_3"
	type: "Deconvolution"
	bottom: "deconv4_2"
	top: "deconv4_3"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm4_3"
	type: "BatchNorm"
	bottom: "deconv4_3"
	top: "deconv4_3"
}

layer {
	name: "derelu4_3"
	type: "ReLU"
	bottom: "deconv4_3"
	top: "deconv4_3"
}

layer {
	name: "deconv4_4"
	type: "Deconvolution"
	bottom: "deconv4_3"
	top: "deconv4_4"
	convolution_param {
		num_output: 512
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm4_4"
	type: "BatchNorm"
	bottom: "deconv4_4"
	top: "deconv4_4"
}

layer {
	name: "derelu4_4"
	type: "ReLU"
	bottom: "deconv4_4"
	top: "deconv4_4"
}

layer {
	name: "deconv3_1"
	type: "Deconvolution"
	bottom: "deconv4_4"
	top: "deconv3_1"
	convolution_param {
		num_output: 256
		pad: 0
		kernel_size: 2
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "deconv3_2"
	type: "Deconvolution"
	bottom: "deconv3_1"
	top: "deconv3_2"
	convolution_param {
		num_output: 256
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm3_2"
	type: "BatchNorm"
	bottom: "deconv3_2"
	top: "deconv3_2"
}

layer {
	name: "derelu3_2"
	type: "ReLU"
	bottom: "deconv3_2"
	top: "deconv3_2"
}

layer {
	name: "deconv3_3"
	type: "Deconvolution"
	bottom: "deconv3_2"
	top: "deconv3_3"
	convolution_param {
		num_output: 256
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm3_3"
	type: "BatchNorm"
	bottom: "deconv3_3"
	top: "deconv3_3"
}

layer {
	name: "derelu3_3"
	type: "ReLU"
	bottom: "deconv3_3"
	top: "deconv3_3"
}

layer {
	name: "deconv3_4"
	type: "Deconvolution"
	bottom: "deconv3_3"
	top: "deconv3_4"
	convolution_param {
		num_output: 256
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm3_4"
	type: "BatchNorm"
	bottom: "deconv3_4"
	top: "deconv3_4"
}

layer {
	name: "derelu3_4"
	type: "ReLU"
	bottom: "deconv3_4"
	top: "deconv3_4"
}

layer {
	name: "deconv2_1"
	type: "Deconvolution"
	bottom: "deconv3_4"
	top: "deconv2_1"
	convolution_param {
		num_output: 128
		pad: 0
		kernel_size: 2
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "deconv2_2"
	type: "Deconvolution"
	bottom: "deconv2_1"
	top: "deconv2_2"
	convolution_param {
		num_output: 128
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm2_2"
	type: "BatchNorm"
	bottom: "deconv2_2"
	top: "deconv2_2"
}

layer {
	name: "derelu2_2"
	type: "ReLU"
	bottom: "deconv2_2"
	top: "deconv2_2"
}

layer {
	name: "deconv2_3"
	type: "Deconvolution"
	bottom: "deconv2_2"
	top: "deconv2_3"
	convolution_param {
		num_output: 128
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm2_3"
	type: "BatchNorm"
	bottom: "deconv2_3"
	top: "deconv2_3"
}

layer {
	name: "derelu2_3"
	type: "ReLU"
	bottom: "deconv2_3"
	top: "deconv2_3"
}

layer {
	name: "deconv1_1"
	type: "Deconvolution"
	bottom: "deconv2_3"
	top: "deconv1_1"
	convolution_param {
		num_output: 64
		pad: 0
		kernel_size: 2
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "deconv1_2"
	type: "Deconvolution"
	bottom: "deconv1_1"
	top: "deconv1_2"
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm1_2"
	type: "BatchNorm"
	bottom: "deconv1_2"
	top: "deconv1_2"
}

layer {
	name: "derelu1_2"
	type: "ReLU"
	bottom: "deconv1_2"
	top: "deconv1_2"
}

layer {
	name: "deconv1_3"
	type: "Deconvolution"
	bottom: "deconv1_2"
	top: "deconv1_3"
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}

layer {
	name: "debatchnorm1_3"
	type: "BatchNorm"
	bottom: "deconv1_3"
	top: "deconv1_3"
}

layer {
	name: "derelu1_3"
	type: "ReLU"
	bottom: "deconv1_3"
	top: "deconv1_3"
}

layer {
	name: "heatmaps"
	type: "Convolution"
	bottom: "deconv1_3"
	top: "heatmaps"
	convolution_param {
		num_output: 1
		pad: 0
		kernel_size: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
}



layer {
	name: "loss"
	type: "EuclideanLoss"
	bottom: "heatmaps"
	bottom: "labels"
	top: "loss"
}
